mkulesh/stm32DevelopmentBoards/src/StmPlusPlus/StmPlusPlus.cpp
void Usart::stop ()
{
    HAL_UART_DeInit(&usartParameters);
    device->disableClock();
    txPin.setMode(GPIO_MODE_INPUT);
    rxPin.setMode(GPIO_MODE_INPUT);
}

/************************************************************************
 * Class UsartLogger
 ************************************************************************/

UsartLogger * UsartLogger::instance = NULL;

UsartLogger::UsartLogger (const HardwareLayout::Usart * _device, uint32_t _baudRate):
    Usart{_device},
    baudRate{_baudRate}
{
    // empty
}

void UsartLogger::initInstance ()
{
    instance = this;
    start(UART_MODE_TX, baudRate, UART_WORDLENGTH_8B, UART_STOPBITS_1, UART_PARITY_NONE);
    while (HAL_UART_GetState(&usartParameters) != HAL_UART_STATE_READY);
    startInterrupt();
}

UsartLogger & UsartLogger::operator << (const char * buffer)
{
    size_t bSize = ::strlen(buffer);
    if (bSize > 0)
    {
        waitForRelease();
        transmitIt(buffer, bSize);
    }
    return *this;
}

UsartLogger & UsartLogger::operator << (int n)
{
    char buffer[1024];
    ::__itoa(n, buffer, 10);
    size_t bSize = ::strlen(buffer);
    if (bSize > 0)
    {
        waitForRelease();
        transmitIt(buffer, bSize);
    }
    return *this;
}

UsartLogger & UsartLogger::operator << (Manupulator /*m*/)
{
    waitForRelease();
    transmitIt("\n\r", 2);
    return *this;
}

void UsartLogger::waitForRelease ()
{
    uint32_t t1 = HAL_GetTick();
    while (!isFinished())
    {
        uint32_t t2 = HAL_GetTick();
        if (t2 - t1 > TIMEOUT)
        {
            break;
        }
    }
}


/************************************************************************
 * Class TimerBase
 ************************************************************************/
TimerBase::TimerBase (const HardwareLayout::Timer * _device):
    device{_device}
{
    timerParameters.Instance = device->instance;
}


HAL_StatusTypeDef TimerBase::startCounter (uint32_t counterMode,
                         uint32_t prescaler,
                         uint32_t period,
                         uint32_t clockDivision/* = TIM_CLOCKDIVISION_DIV1*/)
{
    device->enableClock();
    timerParameters.Init.CounterMode = counterMode;
    timerParameters.Init.Prescaler = prescaler;
    timerParameters.Init.Period = period;
    timerParameters.Init.ClockDivision = clockDivision;
    __HAL_TIM_SET_COUNTER(&timerParameters, 0);
    HAL_TIM_Base_Init(&timerParameters);
    return HAL_TIM_Base_Start(&timerParameters);
}


void TimerBase::stopCounter ()
{
    HAL_TIM_Base_Stop(&timerParameters);
    HAL_TIM_Base_DeInit(&timerParameters);
    device->disableClock();
}

/************************************************************************
 * Class PulseWidthModulation
 ************************************************************************/
PulseWidthModulation::PulseWidthModulation (const HardwareLayout::Timer * _device, IOPort::PortName name, uint32_t _pin,  uint32_t _channel):
    TimerBase{_device},
    pin{name, _pin, GPIO_MODE_AF_PP, GPIO_PULLDOWN, GPIO_SPEED_FREQ_HIGH, false, false},
    channel{_channel}
{
    pin.setAlternate(device->alternate);
    timerParameters.Init.Prescaler     = 0;
    timerParameters.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    timerParameters.Init.CounterMode   = TIM_COUNTERMODE_UP;
    channelParameters.OCMode           = TIM_OCMODE_PWM1;
    channelParameters.OCPolarity       = TIM_OCPOLARITY_HIGH;
    channelParameters.OCFastMode       = TIM_OCFAST_DISABLE;
}


bool PulseWidthModulation::start (uint32_t freq)
{
    device->enableClock();

    uint32_t uwPeriodValue = SystemCoreClock/freq;
    timerParameters.Init.Period = uwPeriodValue - 1;
    channelParameters.Pulse = uwPeriodValue/2;

    HAL_StatusTypeDef status = HAL_TIM_PWM_Init(&timerParameters);
    if(status != HAL_OK)
    {
        USART_DEBUG("Cannot initialize PWM timer: " << status);
        return false;
    }

    status = HAL_TIM_PWM_ConfigChannel(&timerParameters, &channelParameters, channel);
    if(status != HAL_OK)
    {
        USART_DEBUG("Cannot initialize PWM channel: " << status);
        return false;
    }

    status = HAL_TIM_PWM_Start(&timerParameters, channel);
    if(status != HAL_OK)
    {
        USART_DEBUG("Cannot start PWM: " << status);
        return false;
    }
    return true;
}


void PulseWidthModulation::stop ()
{
    HAL_TIM_PWM_Stop(&timerParameters, channel);
    device->disableClock();
    pin.setLow();
}

/************************************************************************
 * Class Timer
 ************************************************************************/
Timer::Timer (const HardwareLayout::Timer * _device):
    TimerBase(_device),
    handler(NULL)
{
    // empty
}


#ifdef STM32F4
void Timer::setPrescaler (uint32_t prescaler)
{
    timerParameters.Init.Prescaler = prescaler;
    __HAL_TIM_SET_PRESCALER(&timerParameters, prescaler);
}

void Timer::setPeriod (uint32_t period)
{
    timerParameters.Init.Period = period;
    __HAL_TIM_SET_AUTORELOAD(&timerParameters, period);
}
#endif


HAL_StatusTypeDef Timer::start (uint32_t counterMode,
                         uint32_t prescaler,
                         uint32_t period,
                         uint32_t clockDivision/* = TIM_CLOCKDIVISION_DIV1*/,
                         uint32_t repetitionCounter/* = 1*/)
{
    device->enableClock();
    device->timerIrq.start();
    timerParameters.Init.CounterMode = counterMode;
    timerParameters.Init.Prescaler = prescaler;
    timerParameters.Init.Period = period;
    timerParameters.Init.ClockDivision = clockDivision;
    timerParameters.Init.RepetitionCounter = repetitionCounter;
    __HAL_TIM_SET_COUNTER(&timerParameters, 0);

    HAL_TIM_Base_Init(&timerParameters);
    HAL_StatusTypeDef status = HAL_TIM_Base_Start_IT(&timerParameters);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not initialize timer: " << status);
        return HAL_ERROR;
    }

    USART_DEBUG("Started timer, irqPrio = " << device->timerIrq.prio << "," << device->timerIrq.subPrio);
    return status;
}


void Timer::processInterrupt () const
{
    if (__HAL_TIM_GET_FLAG(&timerParameters, TIM_FLAG_UPDATE) != RESET)
    {
        if (__HAL_TIM_GET_IT_SOURCE(&timerParameters, TIM_IT_UPDATE) != RESET)
        {
            __HAL_TIM_CLEAR_IT(&timerParameters, TIM_IT_UPDATE);
            if (handler != NULL)
            {
                handler->onTimerUpdate(this);
            }
        }
    }
}


