mkulesh/stm32DevelopmentBoards/src/StmPlusPlus/StmPlusPlus.cpp
    USART_DEBUG("Started SPI " << device->id
             << ": BaudRatePrescaler = " << spiParams.Init.BaudRatePrescaler
             << ", DataSize = " << spiParams.Init.DataSize
             << ", CLKPhase = " << spiParams.Init.CLKPhase
             << ", Status = " << status);

    return status;
}


void Spi::stop ()
{
    USART_DEBUG("Stopping SPI " << device->id);
    device->txIrq.stop();
    HAL_DMA_DeInit(&txDma);
    HAL_SPI_DeInit(&spiParams);
    device->disableClock();
    pins.setMode(GPIO_MODE_INPUT);
    client = NULL;
}


/************************************************************************
 * Class PeriodicalEvent
 ************************************************************************/
PeriodicalEvent::PeriodicalEvent (time_ms _delay, long _maxOccurrence /* = -1*/):
    lastEventTime(0),
    delay(_delay),
    maxOccurrence(_maxOccurrence),
    occurred(0)
{
    // empty
}


void PeriodicalEvent::resetTime ()
{
    lastEventTime = RealTimeClock::getInstance()->getUpTimeMillisec();
    occurred = 0;
}


bool PeriodicalEvent::isOccured ()
{
    if (maxOccurrence > 0 && occurred >= maxOccurrence)
    {
        return false;
    }
    time_ms now = RealTimeClock::getInstance()->getUpTimeMillisec();
    if (now >= lastEventTime + delay)
    {
        lastEventTime = now;
        if (maxOccurrence > 0)
        {
            ++occurred;
        }
        return true;
    }
    return false;
}


/************************************************************************
 * Class AnalogToDigitConverter
 ************************************************************************/

AnalogToDigitConverter::AnalogToDigitConverter (const HardwareLayout::Adc * _device, uint32_t channel, uint32_t samplingTime, float _vRef):
    device{_device},
    pin{_device->pins, GPIO_MODE_ANALOG, GPIO_NOPULL},
    vRef{_vRef},
    vMeasured{0.0},
    nrReadings{0}
{
    adcParams.Instance = device->instance;

    #ifdef STM32F4
    adcParams.Init.ClockPrescaler = ADC_CLOCKPRESCALER_PCLK_DIV2;
    adcParams.Init.Resolution = ADC_RESOLUTION_12B;
    adcParams.Init.ScanConvMode = DISABLE;
    adcParams.Init.ContinuousConvMode = ENABLE;
    adcParams.Init.DiscontinuousConvMode = DISABLE;
    adcParams.Init.NbrOfDiscConversion = 0;
    adcParams.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    adcParams.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T1_CC1;
    adcParams.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    adcParams.Init.NbrOfConversion = 1;
    adcParams.Init.DMAContinuousRequests = ENABLE;
    adcParams.Init.EOCSelection = ADC_EOC_SINGLE_CONV;

    adcChannel.Channel = channel; // each channel is connected to the specific pin, see pin descriptions
    adcChannel.Rank = 1;
    adcChannel.SamplingTime = samplingTime;
    adcChannel.Offset = 0;

    rxDma.Instance = device->rxDma.instance;
    rxDma.Init.Channel  = device->rxDma.channel;
    rxDma.Init.Direction = DMA_PERIPH_TO_MEMORY;
    rxDma.Init.PeriphInc = DMA_PINC_DISABLE;
    rxDma.Init.MemInc = DMA_MINC_ENABLE;
    rxDma.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    rxDma.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    rxDma.Init.Mode = DMA_CIRCULAR;
    rxDma.Init.Priority = DMA_PRIORITY_LOW;
    rxDma.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    rxDma.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
    rxDma.Init.MemBurst = DMA_MBURST_SINGLE;
    rxDma.Init.PeriphBurst = DMA_PBURST_SINGLE;
    #endif

    // for Multichannel ADC reading, see
    // https://my.st.com/public/STe2ecommunities/mcu/Lists/cortex_mx_stm32/flat.aspx?RootFolder=%2Fpublic%2FSTe2ecommunities%2Fmcu%2FLists%2Fcortex_mx_stm32%2FMultichannel%20ADC%20reading&FolderCTID=0x01200200770978C69A1141439FE559EB459D7580009C4E14902C3CDE46A77F0FFD06506F5B&currentviews=105
}


HAL_StatusTypeDef AnalogToDigitConverter::start ()
{
    device->enableClock();

    HAL_StatusTypeDef status = HAL_ADC_Init(&adcParams);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not initialize ACD " << device->id << ": " << status);
        return status;
    }

    status = HAL_ADC_ConfigChannel(&adcParams, &adcChannel);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not configure ACD channel " << adcChannel.Channel << ": " << status);
        return status;
    }

    status = HAL_DMA_Init(&rxDma);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not configure ACD/DMA channel " << adcChannel.Channel << ": " << status);
        return status;
    }
    __HAL_LINKDMA(&adcParams, DMA_Handle, rxDma);

    USART_DEBUG("Started ACD " << device->id
             << ": channel = " << adcChannel.Channel
             << ", irqPrio = " << device->rxIrq.prio << "," << device->rxIrq.subPrio
             << ", Status = " << status);

    device->rxIrq.start();

    return status;
}


void AnalogToDigitConverter::stop ()
{
    USART_DEBUG("Stopping ADC " << device->id);
    device->rxIrq.stop();
    HAL_DMA_DeInit(&rxDma);
    HAL_ADC_DeInit(&adcParams);
    device->disableClock();
}


float AnalogToDigitConverter::read ()
{
    uint32_t value = INVALID_VALUE;
    if (HAL_ADC_Start(&adcParams) == HAL_OK)
    {
        if (HAL_ADC_PollForConversion(&adcParams, 10000) == HAL_OK)
        {
            value = HAL_ADC_GetValue(&adcParams);
        }
    }
    HAL_ADC_Stop(&adcParams);
    return (vRef * (float)value)/4095.0;
}


HAL_StatusTypeDef AnalogToDigitConverter::readDma ()
{
    nrReadings = 0;
    vMeasured = 0;
    adcBuffer.fill(0);
    device->rxIrq.start();
    return HAL_ADC_Start_DMA(&adcParams, adcBuffer.data(), ADC_BUFFER_LENGTH - 1);
}


bool AnalogToDigitConverter::processConvCpltCallback ()
{
    ++nrReadings;
    if (nrReadings + 1 < ADC_BUFFER_LENGTH)
    {
        return false;
    }

    device->rxIrq.stop();
    HAL_ADC_Stop_DMA(&adcParams);
    std::sort(adcBuffer.begin(), adcBuffer.end());
    vMeasured = (vRef * (float)adcBuffer[ADC_BUFFER_LENGTH/2])/4095.0;
    return true;
}


/************************************************************************
 * Class I2S
 ************************************************************************/
I2S::I2S (const HardwareLayout::I2S * _device):
    device{_device},
    pins{_device->pins, GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW}
{
    pins.setMode(GPIO_MODE_AF_PP);
    i2s.Instance = device->instance;
    i2s.Init.Mode = I2S_MODE_MASTER_TX;
    i2s.Init.Standard = I2S_STANDARD_PHILIPS; // will be re-defined at communication start
    i2s.Init.DataFormat = I2S_DATAFORMAT_16B; // will be re-defined at communication start
    i2s.Init.MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
    i2s.Init.AudioFreq = I2S_AUDIOFREQ_44K; // will be re-defined at communication start
    i2s.Init.CPOL = I2S_CPOL_LOW;
    i2s.Init.ClockSource = I2S_CLOCK_PLL;
    i2s.Init.FullDuplexMode = I2S_FULLDUPLEXMODE_DISABLE;

    txDma.Instance = device->txDma.instance;
    txDma.Init.Channel = device->txDma.channel;
    txDma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    txDma.Init.PeriphInc = DMA_PINC_DISABLE;
    txDma.Init.MemInc = DMA_MINC_ENABLE;
    txDma.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    txDma.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    txDma.Init.Mode = DMA_NORMAL;
    txDma.Init.Priority = DMA_PRIORITY_LOW;
    txDma.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
    txDma.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
    txDma.Init.MemBurst = DMA_PBURST_SINGLE;
    txDma.Init.PeriphBurst = DMA_PBURST_SINGLE;
}


HAL_StatusTypeDef I2S::start (uint32_t standard, uint32_t audioFreq, uint32_t dataFormat)
{
    i2s.Init.Standard = standard;
    i2s.Init.AudioFreq = audioFreq;
    i2s.Init.DataFormat = dataFormat;

    device->enableClock();
    HAL_StatusTypeDef status = HAL_I2S_Init(&i2s);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not start I2S: " << status);
        return HAL_ERROR;
    }

    __HAL_LINKDMA(&i2s, hdmatx, txDma);
    status = HAL_DMA_Init(&txDma);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not initialize I2S DMA/TX channel: " << status);
        return HAL_ERROR;
    }
    device->txIrq.start();

    return HAL_OK;
}


void I2S::stop ()
{
    device->txIrq.stop();
    HAL_DMA_DeInit(&txDma);
    HAL_I2S_DeInit(&i2s);
    device->disableClock();
}


